tutorials/VOF/variableTau/twoChannels/default/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 1e-3;
scale 1e-3;

Lx0 0;
Ly0 0;
Lz0 0.0;
Lx1 3.0;
Ly1 1.0;
Lz1 0.01;

vertices
(
    ($Lx0 $Ly0 $Lz0)
    ($Lx1 $Ly0 $Lz0)
    ($Lx1 $Ly1 $Lz0)
    ($Lx0 $Ly1 $Lz0)
    ($Lx0 $Ly0 $Lz1)
    ($Lx1 $Ly0 $Lz1)
    ($Lx1 $Ly1 $Lz1)
    ($Lx0 $Ly1 $Lz1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (540 180 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    emptyFaces
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
